[
  {
    "id": "1755230161037-eq608v",
    "title": "Conversation 2 : គុយទាវភ្នំពេញ • Kuy Teav Phnom Penh",
    "level": "Beginner",
    "script": "Khmer",
    "topic": "Food",
    "description": "Sophea and John talks about an iconic Khmer cuisine.",
    "transcript": "សុភា៖ អេចន ញ៊ាំបាយហេីយឬនៅ?\n\nSophea: Hey John, have you eaten yet?\n\nចន៖ បាទ ខ្ញុំទើបតែញ៊ាំអាហារពេលព្រឹក។\n\nJohn: Yeah, I just had breakfast.\n\nសុភា៖ អូ បានអីញ៊ាំឯ\n\nSophea: Oh, what did you eat?\n\nចន៖ ខ្ញុំញ៊ាំអូម៉ែឡែត ជាមួយនំប៊ុង។\n\nJohn: I had an omelette with toast.\n\nសុភា៖ ដូចជាឆ្ងាញ់ណាស់។\n\nSophea: Sounds delicious.\n\nចន៖ បាទ ខ្ញុំញ៊ាំតែអញ្ចឹងនៅអាមេរិក។ ចុះអ្នកវិញ?\n\nJohn: Yeah, that’s what I normally eat in America. How about you?\n\nសុភា៖ ខ្ញុំញ៊ាំគុយទាវភ្នំពេញ។\n\nSophea: I had kuy teav phnom penh.\n\nចន៖ អីគេនឹង?\n\nJohn: What’s that?\n\nសុភា៖ វាជាមីស៊ុបម៉្យាង។ គុយទាវគឺមីអង្ករ ហេីយភ្នំពេញគឺរាជធានី។ វាមានដើមកំណើតមកពីទៅនោះ។\n\nSophea: It’s a type of noodle soup. Kuy teav is rice noodle and Phnom Penh is the capital city. It orginaed there.\n\nចន៖ គ្រឿងផ្សំអ្វី?\n\nJohn: What are the ingredients?\n\nសុភា៖ ជាទូទៅ វាមានគុយទាវក្នុងស៊ុបជាមួយសាច់គោ សាច់ជ្រូក ឬគ្រឿងសមុទ្រ។ វាក៏មានប្រហិតសាច់គោដែរ។\n\nSophea: Normally, it has kuy teav in soup with beef, pork or seafood. It also comes with beef meatball.\n\nចន៖ ឡូយណាស់ ដូចជាទំនងណាស់។ ខ្ញុំចង់សាក។\n\nJohn: Wow, sounds so good. I want to try.\n\nសុភា៖ ចាស ខ្ញុំអាចនាំអ្នកទៅហាងញ៊ាំ។\n\nSophea: Yes, I can bring you to a restaurant.",
    "vocabulary": "- ញ៊ាំបាយហេីយឬនៅ?\n   - Literal translation: Have you eaten rice yet?\n   - Other meaning: Have you had a meal yet?\n   - Can be also be used to as a conversation starter, as a form of “hello”\n\n- អូម៉ែឡែត = omellete\n\n- នំបុ័ង = Bread or toast\n\n- ឆ្ងាញ់ = delicious\n\n- គុយទាវ = Kuy Teav\n\n- ភ្នំពេញ = Phnom Penh\n\n- មី = noodle (mostly used for noodles that are made from wheat or egg noodle)\n\n- ស៊ុប = soup\n\n- អង្ករ = rice (used to refer pre-cooked rice. Cooked rice is called បាយ)\n\n- គ្រឿងផ្សំ = ingredients\n\n- សាច់គោ = beef\n   - សាច់ = meat\n   - គោ = cow\n\n- សាច់ជ្រូក = porl\n   - សាច់ = meat\n   - ជ្រូក = pig\n\n- គ្រឿងសមុទ្រ = seafood\n   - គ្រឿង = things, components\n   - សមុទ្រ = sea\n\n- ប្រហិត = meatball",
    "audioUrl": "/audio/conversation2.mp3",
    "exercises": "Answer the questions below in Khmer using your own information\n\n1. ញ៊ាំបាយហេីយឬនៅ?\n\n2. តេីអ្នកញ៊ាំអ្វី?\n\n3. តេីអ្នកចូលចិត្តញ៊ាំបាយឬមី?\n\n4. តេីអ្នកធ្លាប់ញ៊ាំគុយទាវភ្នំពេញទេ?\n\n5. តើអ្នកចូលចិត្តញ៊ាំសាច់អ្វី?"
  },
  {
    "id": "1755225161523-uas7km",
    "title": "Conversation 1 : កោះនរា • Koh Norea ",
    "level": "Beginner",
    "script": "Khmer",
    "description": "Sok and David are chatting about a popular place called Koh Norea in Phnom Penh.",
    "transcript": "សុខ៖ ដេវិតធ្លាប់ទៅលេងកោះនរាដែរឬទេ?\n\nដេវិត៖ បាទសុខ ខ្ញុំធ្លាប់ទៅលេងកោះនរាពីរបីដង។\n\nសុខ៖ ខ្ញុំគិតទៅលេងដែរ។ តើនៅកោះនរាមានអ្វីធ្វើខ្លះ?\n\nដេវិត៖ នៅកោះនរាមានអ្វីធ្វើច្រើនណាស់ ដូចជាទៅលេងសួនកម្សាន្តនិងដើរលេងនៅមាត់ទន្លេជាដើម។\n\nសុខ៖ អូ… ដូចជាសប្បាយណាស់។ តើខ្ញុំគួរជិះអ្វីទៅលឿនជាងគេ?\n\nដេវិត៖ ខ្ញុំគិតថាបើជិះតុកតុកលឿនជាងគេ ព្រោះពិបាករកកន្លែងចតណាស់។\n\nសុខ៖ ពិតជាមានមនុស្សចង់ទៅលេងច្រើនហើយអញ្ចឹង។\n\nដេវិត៖ ត្រូវហើយ។ កោះនរាជាកន្លែងក្មេងៗនិយមដើរលេង។\n\nសុខ៖ នៅឯណាដែរ?\n\nដេវិត៖ នៅចន្លោះកោះពេជ្រ និង ច្បារអំពៅ។\n\nសុខ៖ ពីនេះទៅ ជិះអស់រយះពេលប៉ុន្នាន?\n\nដេវិត៖ ជិះឡានប្រហែល៣០នាទី ហេីយជិះតុកតុកប្រហែល១៥នាទី។\n\nសុខ៖ អូរនៅមិនឆ្ងាយទេ។ ស្តាប់ទៅទំនងណាស់! អញ្ចឹងចុងសប្តាហ៍នេះខ្ញុំនឹងទៅលេងកោះនរា។\n\nSok: David, have you visited Koh Norea before?\n\nDavid: Yes, Sok. I have visited Koh Norea two or three times before.\n\nSok: I was thinking of visiting too. What is there to do at Koh Norea?\n\nDavid: There are lots of things to do at Koh Norea, such as the amusement park and walking along the riverside\n\nSok: Oh… It sounds so fun. What should I ride to get there quickest?\n\nDavid: I think riding a TukTuk would be the fastest because it is hard to find parking.\n\nSok: Then there must be a lot of people who want to visit.\n\nDavid: That’s right. Koh Norea is a popular place for young people to hang out.\n\nSok: Where is it?\n\nDavid: It’s between Koh Pich and Chbar Ampov.\n\nSok: How long does it take to get there from here?\n\nDavid: It takes around 30 minutes by car and takes around 15 minutes by Tuk Tuk.\n\nSok: Oh not that far. It sounds so exciting! In that case, I will visit Koh Norea this weekend.",
    "vocabulary": "- ទៅលេង = vist\n   - ទៅ = go\n   - លេង = play\n\n- សួនកម្សាន្ត = amusement park\n   - សួន = park\n   - កម្សាន្ត = amuse; enjoy\n\n- មាត់ទន្លេ = river side\n   - មាត់ = mouth\n   - ទន្លេ = river\n\n- សប្បាយ = fun; happy\n\n- ជិះ = ride\n\n- លឿន = fast\n\n- តុកតុក = Tuk Tuk\n\n- ពិបាក = hard\n\n- កន្លែងចត = parking spot\n   - កន្លែង = place\n   - ចត = park\n\n- ច្រើន = many; a lot\n\n- ក្មេងៗ = young people\n   - ក្មេង = young\n\n- ចន្លោះ = between\n\n- ឡាន = car\n\n- ឆ្ងាយ = far\n\n- ទំនង : a slang for “seem cool, sound good)\n\n- ចុងសប្តាហ៍ = weekends\n   - ចុង = end\n   - សប្តាហ៍ = week"
  },
  {
    "id": "intro-phrases",
    "title": "សួស្តី • Greetings",
    "level": "Beginner",
    "script": "Khmer",
    "topic": "Phrases",
    "description": "Common greetings and polite expressions.",
    "transcript": "សួស្តី (suosdei) – Hello \nជំរាបសួរ (chomreabsuor) – Formal hello \nអរគុណ (awkun) – Thank you",
    "audioUrl": "https://cdn.pixabay.com/download/audio/2022/03/15/audio_0b7b2d2d2a.mp3?filename=vocal-loop-1-201402.mp3"
  },
  {
    "id": "numbers-1-10",
    "title": "លេខ ១–១០ • Numbers 1–10",
    "level": "Beginner",
    "script": "Khmer",
    "topic": "Numbers",
    "description": "Counting from 1 to 10 in Khmer.",
    "transcript": "១ (muoy) - 1\n២ (pii) - 2\n ៣ (bei) - 3\n៤ (buon) - 4\n៥ (pram) - 5\n៦ (pram muoy) - 6\n៧ (pram pii) - 7\n៨ (pram bei) - 8\n៩ (pram buon) - 9\n១០ (dap) - 10",
    "audioUrl": "https://cdn.pixabay.com/download/audio/2022/02/23/audio_16a2a2d2e2.mp3?filename=short-music-112188.mp3"
  }
]